const totemsData = {
  "Аист": {
    "Странник": ["Аист", "Кенгуру", "Черепаха"],
    "Опекун": ["Аист", "Слон", "Крокодил"],
    "Целитель": ["Аист", "Лошадь", "Змея"],
    "Хранитель": ["Аист", "Заяц", "Бобёр"],
    "Вестник": ["Аист", "Лиса", "Лягушка"]
  },
  "Акула": {
    "Странник": ["Жаворонок", "Гепард", "Акула"],
    "Разрушитель": ["Летучая мышь", "Гиена", "Акула"]
  },
  "Бабочка": {
    "Миротворец": ["Бабочка", "Панда", "Пингвин"],
    "Мечтатель": ["Бабочка", "Ленивец", "Медуза"],
    "Сновидец": ["Бабочка", "Коала", "Паук"],
    "Вдохновитель": ["Бабочка", "Жираф", "Черепаха"]
  },
  "Баран": {
    "Защитник": ["Петух", "Баран", "Ёж"],
    "Соратник": ["Гусь", "Баран", "Дельфин"],
    "Вожак": ["Орёл", "Баран", "Морж"]
  },
  "Бегемот": {
    "Защитник": ["Орёл", "Носорог", "Бегемот"],
    "Опекун": ["Лебедь", "Слон", "Бегемот"]
  },
  "Белка": {
    "Творец": ["Дятел", "Белка", "Паук"],
    "Собиратель": ["Дятел", "Белка", "Хомяк"],
    "Сеятель": ["Пчела", "Белка", "Муравей"],
    "Хранитель": ["Пчела", "Белка", "Бобёр"]
  },
  "Бобёр": {
    "Творец": ["Дятел", "Сурикат", "Бобёр"],
    "Труженик": ["Пчела", "Лошадь", "Бобёр"],
    "Хранитель": ["Пчела", "Сурикат", "Бобёр"]
  },
  "Бык": {
    "Защитник": ["Орёл", "Бык", "Бегемот"],
    "Труженик": ["Пчела", "Бык", "Муравей"]
  },
  "Волк": {
    "Защитник": ["Петух", "Волк", "Ёж"],
    "Вожак": ["Орёл", "Волк", "Дельфин"],
    "Ментор": ["Ворон", "Волк", "Дельфин"],
    "Вестник": ["Аист", "Волк", "Змея"],
    "Изгой": ["Стервятник", "Волк", "Скунс"],
    "Бард": ["Соловей", "Волк", "Кит"],
    "Страж": ["Сова", "Волк", "Морж"]
  },
  "Ворон": {
    "Творец": ["Ворон", "Лиса", "Паук"],
    "Ментор": ["Ворон", "Волк", "Дельфин"],
    "Стратег": ["Ворон", "Тигр", "Осьминог"],
    "Мудрец": ["Ворон", "Слон", "Черепаха"]
  },
  "Гепард": {
    "Странник": ["Аист", "Гепард", "Игуана"],
    "Искатель": ["Жаворонок", "Гепард", "Дельфин"]
  },
  "Гиена": {
    "Разрушитель": ["Летучая мышь", "Гиена", "Скорпион"],
    "Бунтарь": ["Кукушка", "Гиена", "Удильщик"]
  },
  "Голубь": {
    "Миротворец": ["Голубь", "Коала", "Пингвин"],
    "Вестник": ["Голубь", "Козёл", "Лягушка"]
  },
  "Горилла": {
    "Вожак": ["Орёл", "Горилла", "Морж"],
    "Ментор": ["Ворон", "Горилла", "Кит"]
  },
  "Гусь": {
    "Странник": ["Гусь", "Лось", "Черепаха"],
    "Соратник": ["Гусь", "Собака", "Муравей"],
    "Вожак": ["Гусь", "Баран", "Пингвин"]
  },
  "Дельфин": {
    "Влюбленный": ["Лебедь", "Олень", "Дельфин"],
    "Соратник": ["Гусь", "Лошадь", "Дельфин"],
    "Ментор": ["Попугай", "Сурикат", "Дельфин"],
    "Искатель": ["Жаворонок", "Кот", "Дельфин"],
    "Вдохновитель": ["Павлин", "Жираф", "Дельфин"]
  },
  "Дятел": {
    "Творец": ["Дятел", "Лиса", "Бобёр"],
    "Собиратель": ["Дятел", "Медведь", "Ёж"]
  },
  "Ёж": {
    "Защитник": ["Петух", "Лось", "Ёж"],
    "Собиратель": ["Дятел", "Кабан", "Ёж"],
    "Труженик": ["Пчела", "Бык", "Ёж"]
  },
  "Енот": {
    "Бунтарь": ["Кукушка", "Енот", "Скунс"],
    "Трикстер": ["Попугай", "Енот", "Хамелеон"],
    "Искатель": ["Летучая мышь", "Енот", "Осьминог"]
  },
  "Жаворонок": {
    "Искатель": ["Жаворонок", "Енот", "Дельфин"],
    "Странник": ["Жаворонок", "Кенгуру", "Акула"]
  },
  "Жираф": {
    "Вдохновитель": ["Орёл", "Жираф", "Черепаха"],
    "Страж": ["Сова", "Жираф", "Пингвин"]
  },
  "Заяц": {
    "Влюбленный": ["Лебедь", "Заяц", "Лягушка"],
    "Хранитель": ["Пчела", "Заяц", "Хомяк"]
  },
  "Змея": {
    "Разрушитель": ["Летучая мышь", "Тигр", "Змея"],
    "Мистик": ["Сова", "Кот", "Змея"],
    "Целитель": ["Ибис", "Лошадь", "Змея"],
    "Вестник": ["Кукушка", "Лиса", "Змея"]
  },
  "Ибис": {
    "Мудрец": ["Ибис", "Слон", "Кит"],
    "Целитель": ["Ибис", "Лошадь", "Саламандра"]
  },
  "Игуана": {
    "Странник": ["Аист", "Кенгуру", "Игуана"],
    "Стратег": ["Сова", "Тигр", "Игуана"]
  },
  "Кабан": {
    "Бунтарь": ["Петух", "Кабан", "Крот"],
    "Собиратель": ["Пчела", "Кабан", "Ёж"]
  },
  "Кенгуру": {
    "Странник": ["Аист", "Кенгуру", "Черепаха"],
    "Опекун": ["Лебедь", "Кенгуру", "Кенгуру"]
  },
  "Кит": {
    "Мудрец": ["Сова", "Слон", "Кит"],
    "Опекун": ["Аист", "Кенгуру", "Кит"],
    "Ментор": ["Ворон", "Горилла", "Кит"],
    "Бард": ["Соловей", "Волк", "Кит"],
    "Вдохновитель": ["Орёл", "Лошадь", "Кит"],
    "Сновидец": ["Бабочка", "Медведь", "Кит"]
  },
  "Коала": {
    "Миротворец": ["Голубь", "Коала", "Пингвин"],
    "Сновидец": ["Бабочка", "Коала", "Медуза"]
  },
  "Козёл": {
    "Бунтарь": ["Кукушка", "Козёл", "Крот"],
    "Вестник": ["Голубь", "Козёл", "Лягушка"]
  },
  "Кот": {
    "Влюбленный": ["Павлин", "Кот", "Лягушка"],
    "Трикстер": ["Попугай", "Кот", "Хамелеон"],
    "Мистик": ["Сова", "Кот", "Змея"],
    "Искатель": ["Летучая мышь", "Кот", "Осьминог"],
    "Бард": ["Соловей", "Кот", "Кит"]
  },
  "Крокодил": {
    "Разрушитель": ["Стервятник", "Тигр", "Крокодил"],
    "Опекун": ["Аист", "Свинья", "Крокодил"]
  },
  "Крот": {
    "Странник": ["Жаворонок", "Лошадь", "Крот"],
    "Бунтарь": ["Кукушка", "Енот", "Крот"]
  },
  "Кукушка": {
    "Бунтарь": ["Кукушка", "Кабан", "Удильщик"],
    "Трикстер": ["Кукушка", "Лиса", "Осьминог"],
    "Вестник": ["Кукушка", "Волк", "Змея"]
  },
  "Лебедь": {
    "Миротворец": ["Лебедь", "Коала", "Пингвин"],
    "Влюбленный": ["Лебедь", "Олень", "Дельфин"],
    "Соратник": ["Лебедь", "Собака", "Муравей"],
    "Опекун": ["Лебедь", "Кенгуру", "Крокодил"]
  },
  "Лев": {
    "Защитник": ["Орёл", "Лев", "Бегемот"],
    "Вожак": ["Орёл", "Лев", "Кит"],
    "Изгой": ["Стервятник", "Лев", "Скунс"],
    "Вдохновитель": ["Павлин", "Лев", "Черепаха"]
  },
  "Ленивец": {
    "Миротворец": ["Голубь", "Ленивец", "Хомяк"],
    "Мечтатель": ["Бабочка", "Ленивец", "Медуза"]
  },
  "Летучая мышь": {
    "Разрушитель": ["Летучая мышь", "Гиена", "Скорпион"],
    "Искатель": ["Летучая мышь", "Кот", "Осьминог"],
    "Мистик": ["Летучая мышь", "Лиса", "Змея"],
    "Сновидец": ["Летучая мышь", "Медведь", "Паук"]
  },
  "Лиса": {
    "Творец": ["Ворон", "Лиса", "Паук"],
    "Мистик": ["Летучая мышь", "Лиса", "Змея"],
    "Вестник": ["Кукушка", "Лиса", "Лягушка"],
    "Стратег": ["Сова", "Лиса", "Осьминог"]
  },
  "Лось": {
    "Странник": ["Аист", "Лось", "Черепаха"],
    "Защитник": ["Орёл", "Лось", "Бегемот"],
    "Вожак": ["Гусь", "Лось", "Дельфин"]
  },
  "Лошадь": {
    "Странник": ["Жаворонок", "Лошадь", "Черепаха"],
    "Соратник": ["Лебедь", "Лошадь", "Дельфин"],
    "Целитель": ["Аист", "Лошадь", "Змея"],
    "Труженик": ["Пчела", "Лошадь", "Муравей"],
    "Вдохновитель": ["Павлин", "Лошадь", "Кит"]
  },
  "Лягушка": {
    "Влюбленный": ["Соловей", "Заяц", "Лягушка"],
    "Вестник": ["Кукушка", "Козёл", "Лягушка"]
  },
  "Медведь": {
    "Разрушитель": ["Летучая мышь", "Медведь", "Акула"],
    "Защитник": ["Орёл", "Медведь", "Бегемот"],
    "Собиратель": ["Пчела", "Медведь", "Хомяк"],
    "Сновидец": ["Бабочка", "Медведь", "Паук"],
    "Целитель": ["Ибис", "Медведь", "Саламандра"]
  },
  "Медуза": {
    "Мечтатель": ["Бабочка", "Ленивец", "Медуза"],
    "Сновидец": ["Летучая мышь", "Коала", "Медуза"]
  },
  "Морж": {
    "Вожак": ["Гусь", "Горилла", "Морж"],
    "Страж": ["Орёл", "Жираф", "Морж"]
  },
  "Муравей": {
    "Соратник": ["Пчела", "Баран", "Муравей"],
    "Опекун": ["Лебедь", "Кенгуру", "Муравей"],
    "Творец": ["Ворон", "Сурикат", "Муравей"],
    "Собиратель": ["Пчела", "Белка", "Муравей"],
    "Труженик": ["Пчела", "Бык", "Муравей"],
    "Хранитель": ["Аист", "Заяц", "Муравей"],
    "Сеятель": ["Пчела", "Белка", "Муравей"]
  },
  "Мышь": {
    "Миротворец": ["Голубь", "Олень", "Мышь"],
    "Собиратель": ["Дятел", "Белка", "Мышь"]
  },
  "Носорог": {
    "Бунтарь": ["Петух", "Носорог", "Скунс"],
    "Защитник": ["Орёл", "Носорог", "Бегемот"]
  },
  "Олень": {
    "Влюбленный": ["Павлин", "Олень", "Дельфин"],
    "Миротворец": ["Голубь", "Олень", "Мышь"]
  },
  "Орёл": {
    "Защитник": ["Орёл", "Лев", "Бегемот"],
    "Вожак": ["Орёл", "Волк", "Кит"],
    "Вдохновитель": ["Орёл", "Жираф", "Черепаха"],
    "Страж": ["Орёл", "Сурикат", "Пингвин"]
  },
  "Осьминог": {
    "Трикстер": ["Попугай", "Енот", "Осьминог"],
    "Творец": ["Ворон", "Лиса", "Осьминог"],
    "Стратег": ["Сова", "Тигр", "Осьминог"],
    "Искатель": ["Летучая мышь", "Гепард", "Осьминог"]
  },
  "Павлин": {
    "Влюбленный": ["Павлин", "Олень", "Дельфин"],
    "Вдохновитель": ["Павлин", "Жираф", "Черепаха"]
  },
  "Панда": {
    "Миротворец": ["Бабочка", "Панда", "Мышь"],
    "Трикстер": ["Попугай", "Панда", "Хамелеон"]
  },
  "Паук": {
    "Творец": ["Ворон", "Лиса", "Паук"],
    "Мистик": ["Сова", "Кот", "Паук"],
    "Целитель": ["Пчела", "Медведь", "Паук"],
    "Сновидец": ["Бабочка", "Коала", "Паук"]
  },
  "Петух": {
    "Бунтарь": ["Петух", "Козёл", "Рак"],
    "Защитник": ["Петух", "Баран", "Ёж"],
    "Вожак": ["Петух", "Лось", "Морж"],
    "Вестник": ["Петух", "Лиса", "Лягушка"],
    "Страж": ["Петух", "Собака", "Пингвин"]
  },
  "Пингвин": {
    "Миротворец": ["Лебедь", "Коала", "Пингвин"],
    "Вожак": ["Орёл", "Лев", "Пингвин"],
    "Ментор": ["Попугай", "Горилла", "Пингвин"],
    "Страж": ["Сова", "Жираф", "Пингвин"]
  },
  "Попугай": {
    "Трикстер": ["Попугай", "Енот", "Осьминог"],
    "Ментор": ["Попугай", "Волк", "Дельфин"]
  },
  "Пчела": {
    "Соратник": ["Пчела", "Баран", "Муравей"],
    "Опекун": ["Пчела", "Кенгуру", "Крокодил"],
    "Творец": ["Пчела", "Белка", "Паук"],
    "Собиратель": ["Пчела", "Медведь", "Хомяк"],
    "Целитель": ["Пчела", "Лошадь", "Змея"],
    "Труженик": ["Пчела", "Бык", "Муравей"],
    "Хранитель": ["Пчела", "Сурикат", "Бобёр"],
    "Сеятель": ["Пчела", "Белка", "Муравей"]
  },
  "Рак": {
    "Странник": ["Жаворонок", "Лось", "Рак"],
    "Бунтарь": ["Петух", "Гиена", "Рак"],
    "Изгой": ["Стервятник", "Лев", "Рак"]
  },
  "Саламандра": {
    "Мистик": ["Летучая мышь", "Кот", "Саламандра"],
    "Целитель": ["Ибис", "Лошадь", "Саламандра"],
    "Вестник": ["Кукушка", "Волк", "Саламандра"]
  },
  "Свинья": {
    "Опекун": ["Лебедь", "Свинья", "Крокодил"],
    "Собиратель": ["Дятел", "Свинья", "Кабан"]
  },
  "Скорпион": {
    "Разрушитель": ["Летучая мышь", "Тигр", "Скорпион"],
    "Мистик": ["Сова", "Кот", "Скорпион"]
  },
  "Скунс": {
    "Бунтарь": ["Петух", "Носорог", "Скунс"],
    "Изгой": ["Стервятник", "Волк", "Скунс"]
  },
  "Слон": {
    "Мудрец": ["Сова", "Слон", "Кит"],
    "Творец": ["Дятел", "Слон", "Бобёр"],
    "Ментор": ["Ворон", "Слон", "Дельфин"],
    "Опекун": ["Лебедь", "Слон", "Крокодил"]
  },
  "Собака": {
    "Защитник": ["Орёл", "Собака", "Бегемот"],
    "Соратник": ["Гусь", "Собака", "Муравей"],
    "Целитель": ["Аист", "Собака", "Змея"],
    "Страж": ["Петух", "Собака", "Пингвин"]
  },
  "Сова": {
    "Мудрец": ["Сова", "Слон", "Черепаха"],
    "Стратег": ["Сова", "Лиса", "Паук"],
    "Мистик": ["Сова", "Кот", "Хамелеон"],
    "Сновидец": ["Сова", "Медведь", "Медуза"],
    "Страж": ["Сова", "Сурикат", "Морж"]
  },
  "Соловей": {
    "Влюбленный": ["Соловей", "Олень", "Дельфин"],
    "Бард": ["Соловей", "Волк", "Кит"]
  },
  "Стервятник": {
    "Разрушитель": ["Стервятник", "Гиена", "Скорпион"],
    "Изгой": ["Стервятник", "Лев", "Удильщик"]
  },
  "Сурикат": {
    "Трикстер": ["Попугай", "Сурикат", "Хамелеон"],
    "Творец": ["Дятел", "Сурикат", "Бобёр"],
    "Ментор": ["Ворон", "Сурикат", "Пингвин"],
    "Хранитель": ["Пчела", "Сурикат", "Муравей"],
    "Страж": ["Сова", "Сурикат", "Морж"]
  },
  "Тигр": {
    "Разрушитель": ["Стервятник", "Тигр", "Крокодил"],
    "Стратег": ["Сова", "Тигр", "Осьминог"]
  },
  "Удильщик": {
    "Бунтарь": ["Кукушка", "Кабан", "Удильщик"],
    "Изгой": ["Стервятник", "Волк", "Удильщик"]
  },
  "Хамелеон": {
    "Трикстер": ["Попугай", "Енот", "Хамелеон"],
    "Мистик": ["Летучая мышь", "Лиса", "Хамелеон"]
  },
  "Хомяк": {
    "Миротворец": ["Голубь", "Панда", "Хомяк"],
    "Собиратель": ["Пчела", "Белка", "Хомяк"],
    "Хранитель": ["Аист", "Заяц", "Хомяк"]
  },
  "Черепаха": {
    "Мудрец": ["Ибис", "Слон", "Черепаха"],
    "Странник": ["Аист", "Лось", "Черепаха"],
    "Сновидец": ["Бабочка", "Медведь", "Черепаха"],
    "Вдохновитель": ["Орёл", "Жираф", "Черепаха"]
  },
  "Щука": {
    "Разрушитель": ["Летучая мышь", "Медведь", "Щука"],
    "Стратег": ["Ворон", "Лиса", "Щука"]
  },
  "Белый Медведь": {
    "Разрушитель": ["Стервятник", "Белый Медведь", "Акула"],
    "Изгой": ["Ибис", "Белый Медведь", "Рак"],
    "Защитник": ["Орёл", "Белый Медведь", "Бегемот"]
  },
  "Фенёк": {
    "Трикстер": ["Кукушка", "Фенёк", "Хамелеон"],
    "Искатель": ["Жаворонок", "Фенёк", "Дельфин"]
  },
  "Верблюд": {
    "Странник": ["Аист", "Верблюд", "Черепаха"],
    "Труженик": ["Пчела", "Верблюд", "Бобёр"]
  },
  "Рысь": {
    "Стратег": ["Сова", "Рысь", "Щука"],
    "Мистик": ["Летучая мышь", "Рысь", "Скорпион"]
  },
  "Ястреб": {
    "Разрушитель": ["Ястреб", "Тигр", "Змея"],
    "Вестник": ["Ястреб", "Козёл", "Саламандра"]
  }
};